void main(){
  print("Hello, World!");


  /* সহজ কথায় বলতে গেলে, Main Function হলো যেকোনো Dart প্রোগ্রামের "প্রবেশদ্বার" (Entry Point)।
   আপনি যখন একটি প্রোগ্রাম রান বা চালু করেন, তখন কম্পিউটার পুরো কোডের মধ্যে সবার আগে খুঁজে 
   বের করে যে main() ফাংশনটি কোথায় আছে। সেখান থেকেই আপনার কোড কাজ করা শুরু করে।

   Main Function-এর কাজ কী?
১. প্রোগ্রাম শুরু করা: আপনি হাজার হাজার লাইনের কোড লিখলেও কম্পিউটার নিজে থেকে জানবে না 
   কোন লাইনটি আগে পড়বে। main() ফাংশনটি কম্পিউটারকে বলে দেয়, "এখান থেকে শুরু করো।" 
২. অন্যান্য ফাংশনকে কল করা: আপনার প্রোগ্রামের বাকি সব কাজ (যেমন: যোগ করা, ডেটা দেখানো 
    বা অন্য ফাংশন চালানো) এই main() ফাংশনের ভেতর থেকেই নিয়ন্ত্রণ করা হয়। 
৩. অ্যাপের লাইফসাইকেল নিয়ন্ত্রণ করা: Flutter অ্যাপের ক্ষেত্রে এই main() ফাংশনটিই পুরো অ্যাপটিকে 
    স্ক্রিনে লোড বা রান করানোর নির্দেশ দেয়।
    
    
   void: এর মানে হলো এই ফাংশনটি কাজ শেষে কোনো মান ফেরত (return) দেবে না।

   main: এটি ফাংশনের নাম। Dart-এ এটি পরিবর্তন করা যায় না, অবশ্যই main লিখতে হয়।

   (): এই ব্র্যাকেটের ভেতর প্রয়োজনে বিশেষ কমান্ড (Arguments) দেওয়া যায়।

   { }: এই কার্লি ব্র্যাকেটের ভেতরেই আমরা আমাদের আসল কোডগুলো লিখি।



   একটি বাস্তব উদাহরণ
   মনে করুন, একটি স্কুলে অনেকগুলো রুম আছে (এগুলো হলো আলাদা আলাদা ফাংশন), 
   কিন্তু স্কুলের সামনে একটি প্রধান গেট আছে। আপনি স্কুলে ঢুকতে চাইলে অবশ্যই সেই প্রধান গেট দিয়ে ঢুকতে হবে।

   Dart প্রোগ্রামে main() ফাংশনটি হলো সেই প্রধান গেট। এটি ছাড়া আপনি প্রোগ্রামের ভেতরে ঢুকতেই পারবেন না।
    
    
    */
}