void main(){
  //*break in for loop
  for(int i = 0; i < 10; i++){
    if(i == 5){
      break;
    }
    print(i);
  }

  //*continue in for loop
  for(int i = 0; i < 10; i++){
    if(i == 5){
      continue;
    }
    print(i);
  }

  /* Break and Continue Statements
  break শব্দের অর্থ হলো থামিয়ে দেওয়া। লুপ চলাকালীন যদি এমন কোনো পরিস্থিতি আসে 
  যেখানে আপনার লুপটি আর চালানোর প্রয়োজন নেই, তখন break ব্যবহার করা হয়।
  কখন ব্যবহার করবেন: যখন আপনি আপনার কাঙ্ক্ষিত ফলাফল পেয়ে গেছেন এবং বাকি লুপ 
  ঘোরানোর দরকার নেই (যেমন: একটি বড় লিস্ট থেকে নির্দিষ্ট একটি নাম খুঁজে পাওয়া)।

  continue শব্দের অর্থ হলো এড়িয়ে গিয়ে সামনে এগিয়ে যাওয়া। এটি লুপকে থামায় না, 
  বরং লুপের বর্তমান ধাপটি (iteration) বাদ দিয়ে পরবর্তী ধাপে চলে যায়।
  কখন ব্যবহার করবেন: যখন আপনি নির্দিষ্ট কোনো মান বা শর্তের জন্য কাজ করতে চান না, 
  কিন্তু পরেরগুলোর জন্য লুপ চালিয়ে যেতে চান (যেমন: ১-১০ পর্যন্ত প্রিন্ট করবেন কিন্তু শুধু ৩ নম্বরটি বাদ দেবেন)।
  */
}