void main(){
  int i = 1;
  while(i <= 10){
    print(i);
    i++;
  }

  //*while loop to print even numbers from 2 to 20
  int j = 2;
  while(j <= 20){
    print(j);
    j += 2;
  }

  /*উদাহরণ:
আগের মান    যোগ     নতুন মান
     2        +2          4
     4        +2          6
     6        +2          8
     8        +2          10
এভাবে প্রতি ধাপে ২ করে বাড়ছে বলে শুধু জোড় সংখ্যাগুলো পাওয়া যাচ্ছে।*/

  /*While Loop (সর্বাধিক ব্যবহৃত লুপ)
  কখন ব্যবহার করবেন: যখন আপনি জানেন না লুপটি কতবার চলবে, 
  কিন্তু লুপের কাজ শুরু করার আগে কন্ডিশন সত্যি হওয়া বাধ্যতামূলক।

  কাজ করার ধরন: প্রথমে শর্ত পরীক্ষা করবে। যদি শর্ত true হয়, তবেই কোড 
  রান করবে। যদি শুরুতেই শর্ত false হয়, তবে কোড একবারও রান করবে না।*/

}