void main(){
  //*for in loop to print even numbers from 1 to 20
  //* ১ থেকে ২০ পর্যন্ত সব জোড় সংখ্যা (Even numbers) প্রিন্ট করা হয়েছে।
 List<int> numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
  for(int evenNumbers in numbers){
    if(evenNumbers % 2 == 0){
      print(evenNumbers);
    }
  }

  /*
১-২০ পর্যন্ত লিস্ট তৈরি করে লুপ চালানো হয়েছে।
তারপর if দিয়ে চেক করে শুধুমাত্র জোড় সংখ্যাগুলো আউটপুটে দেখানো হয়েছে।
number % 2 == 0: এটি চেক করে সংখ্যাটি ২ দিয়ে বিভাজ্য কি না (অর্থাৎ সংখ্যাটি জোড় কি না)।
যেমন: 2, 4, 6, 8, 10, 12, 14, 16, 18, 20
print(evenNumbers): শর্ত মিলে গেলে সংখ্যাটি স্ক্রিনে দেখায়।
*/


//*for... in loop to iterate over a list of fruits
  List<String> fruits = ['Apple', 'Banana', 'Mango', 'Orange', 'Grapes'];
  for(String fruit in fruits){
    print(fruit);
  }

  /*
* ফলগুলোর একটি লিস্ট তৈরি করে `for-in` লুপ চালানো হয়েছে।
* `List<String> fruits` — `fruits` নামের একটি লিস্টে ফলের নাম রাখা হয়েছে।
* `for(String fruit in fruits)` — লিস্ট থেকে প্রতিটি ফল একে একে `fruit` ভেরিয়েবলে নেওয়া হয়েছে।
* `print(fruit)` — প্রতিটি ফলের নাম আউটপুটে দেখানো হয়েছে।
* যেমন: Apple, Banana, Mango, Orange, Grapes।

**For-in Loop (সহজ এবং সরল)
* `for-in` লুপ হলো লিস্টের প্রতিটি আইটেম একে একে ব্যবহার করার সহজ পদ্ধতি।
* এখানে প্রতিটি আইটেম রাখার জন্য একটি ভেরিয়েবল ব্যবহার করা হয়।
* লুপটি লিস্টের শুরু থেকে শেষ পর্যন্ত প্রতিটি আইটেমের ওপর কাজ করে।
* কখন ব্যবহার করব: যখন লিস্টের প্রতিটি আইটেম নিয়ে কাজ করতে হবে, কিন্তু আইটেমের পজিশন বা ইনডেক্স জানার প্রয়োজন নেই।


*/ 
}