void main(){
  for(int i = 0; i < 5; i++){
    print(i);
  }

  
  //* For loop to calculate the sum of first 100 natural numbers
  //*১ থেকে ১০০ পর্যন্ত সংখ্যাগুলোর যোগফল বের করার জন্য for loop ব্যবহার করা হয়েছে
  int sum = 0;
  for(int i = 1; i <= 100; i++){
    sum += i;
  }
  print("Sum of first 100 natural numbers: $sum");

  //*  যোগফলের হিসাব নিচে দেওয়া হলো:
  /*         i এর মান	      আগের sum	   নতুন sum
             1	              0	         0 + 1 = 1
             2                1	         1 + 2 = 3
             3                3	         3 + 3 = 6
            ....	          .....	       .........
             
             100	আগের যোগফল	সব যোগ হয়ে যাবে
*/


/*For Loop (ট্রেডিশনাল বা সাধারণ লুপ)
এটি সবচেয়ে পুরোনো এবং শক্তিশালী পদ্ধতি। এখানে তিনটি জিনিস বলে দিতে হয়: 
শুরু কোথায়, শেষ কোথায় এবং কত করে বাড়বে। কখন ব্যবহার করবো: যখন আমি 
জানি না লিস্টে কয়টি আইটেম আছে, অথবা আমি যদি উল্টোভাবে (৫, ৪, ৩...) গুনতে চাই,
কিংবা প্রতি ২ ঘর পর পর (১, ৩, ৫...) চেক করতে চাই। তখন For Loop ব্যবহার করতে হয়।*/
}