void main(){
 //* No Parameter and No Return Type Function
 void greet(){
   print("Hello, I am a Function");
 }

 greet();
 myFunction();
}

 void myFunction(){
   print("This is a function with no parameters and no return type.");
 }

 /* 
  উপরের উদাহরণে, আমরা একটি ফাংশন তৈরি করেছি যার নাম greet। এই ফাংশনটি কোনো প্যারামিটার নেয় না 
  এবং কোনো মান রিটার্নও করে না। যখন আমরা greet() ফাংশনটি কল করি, তখন এটি কেবল একটি বার্তা প্রিন্ট করে।

  সংক্ষেপে:
  - No Parameter: ফাংশনের ব্র্যাকেটের মধ্যে কোনো ভেরিয়েবল বা ডেটা নেই।
  - No Return Type: ফাংশনের শেষে কোনো মান রিটার্ন করা হয় না, অর্থাৎ void টাইপ ব্যবহার করা হয়েছে।

  এই ধরনের ফাংশন সাধারণত তখন ব্যবহার করা হয় যখন আপনি কোনো নির্দিষ্ট কাজ সম্পাদন করতে চান, 
  কিন্তু সেই কাজের জন্য কোনো ইনপুট প্রয়োজন নেই এবং কাজটি সম্পন্ন হওয়ার পরে কোনো মান ফেরত দিতে হয় না।

*/